MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C11B0AGN20000/mcu.h
/*******************************************************************************
* DS_MODULE
*******************************************************************************/
typedef struct stc_ds_reg_ctl_field
{
    union {
        struct {
            __IO   uint8_t  RESERVED0            :1;
            __IO   uint8_t  ISUBSEL              :2;
            __IO   uint8_t  RESERVED2            :5;
        };
        struct {
            __IO   uint8_t  RESERVED1            :1;
            __IO   uint8_t  ISUBSEL0             :1;
            __IO   uint8_t  ISUBSEL1             :1;
            __IO   uint8_t  RESERVED3            :5;
        };
    };
} stc_ds_reg_ctl_field_t;

typedef struct stc_ds_rck_ctl_field
{
        __IO   uint8_t  RTCCKE                   :1;
        __IO   uint8_t  CECCKE                   :1;
        __IO   uint8_t  RESERVED0                :6;
} stc_ds_rck_ctl_field_t;

typedef struct stc_ds_mosc_ctl_field
{
    union {
        struct {
            __IO   uint8_t  RESERVED0            :1;
            __IO   uint8_t  IMAINSEL             :2;
            __IO   uint8_t  RESERVED2            :5;
        };
        struct {
            __IO   uint8_t  RESERVED1            :1;
            __IO   uint8_t  IMAINSEL0            :1;
            __IO   uint8_t  IMAINSEL1            :1;
            __IO   uint8_t  RESERVED3            :5;
        };
    };
} stc_ds_mosc_ctl_field_t;

typedef struct stc_ds_cal_ctl_field
{
        __IO   uint8_t  CALSTART                 :1;
        __IO   uint8_t  RESERVED0                :1;
        __IO   uint8_t  BGRSEL                   :1;
        __IO   uint8_t  CALDONE                  :1;
        __IO   uint8_t  RESERVED1                :4;
} stc_ds_cal_ctl_field_t;

typedef struct stc_ds_pmd_ctl_field
{
        __IO   uint8_t  RTCE                     :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_ds_pmd_ctl_field_t;

typedef struct stc_ds_wrfsr_field
{
        __IO   uint8_t  WINITX                   :1;
        __IO   uint8_t  WLVDH                    :1;
        __IO   uint8_t  RESERVED0                :6;
} stc_ds_wrfsr_field_t;

typedef struct stc_ds_wifsr_field
{
        __IO  uint16_t  WRTCI                    :1;
        __IO  uint16_t  WLVDI                    :1;
        __IO  uint16_t  WUI0                     :1;
        __IO  uint16_t  WUI1                     :1;
        __IO  uint16_t  WUI2                     :1;
        __IO  uint16_t  WUI3                     :1;
        __IO  uint16_t  WUI4                     :1;
        __IO  uint16_t  WUI5                     :1;
        __IO  uint16_t  WCEC0I                   :1;
        __IO  uint16_t  WCEC1I                   :1;
        __IO  uint16_t  WUI6                     :1;
        __IO  uint16_t  WUI7                     :1;
        __IO  uint16_t  WUI8                     :1;
        __IO  uint16_t  WUI9                     :1;
        __IO  uint16_t  WUI10                    :1;
        __IO  uint16_t  WUI11                    :1;
} stc_ds_wifsr_field_t;

typedef struct stc_ds_wier_field
{
        __IO  uint16_t  WRTCE                    :1;
        __IO  uint16_t  WLVDE                    :1;
        __IO  uint16_t  RESERVED0                :1;
        __IO  uint16_t  WUI1E                    :1;
        __IO  uint16_t  WUI2E                    :1;
        __IO  uint16_t  WUI3E                    :1;
        __IO  uint16_t  WUI4E                    :1;
        __IO  uint16_t  WUI5E                    :1;
        __IO  uint16_t  WCEC0E                   :1;
        __IO  uint16_t  WCEC1E                   :1;
        __IO  uint16_t  WUI6E                    :1;
        __IO  uint16_t  WUI7E                    :1;
        __IO  uint16_t  WUI8E                    :1;
        __IO  uint16_t  WUI9E                    :1;
        __IO  uint16_t  WUI10E                   :1;
        __IO  uint16_t  WUI11E                   :1;
} stc_ds_wier_field_t;

typedef struct stc_ds_wilvr_field
{
        __IO  uint16_t  WUI1LV                   :1;
        __IO  uint16_t  WUI2LV                   :1;
        __IO  uint16_t  WUI3LV                   :1;
        __IO  uint16_t  WUI4LV                   :1;
        __IO  uint16_t  WUI5LV                   :1;
        __IO  uint16_t  WUI6LV                   :1;
        __IO  uint16_t  WUI7LV                   :1;
        __IO  uint16_t  WUI8LV                   :1;
        __IO  uint16_t  WUI9LV                   :1;
        __IO  uint16_t  WUI10LV                  :1;
        __IO  uint16_t  WUI11LV                  :1;
        __IO  uint16_t  RESERVED0                :5;
} stc_ds_wilvr_field_t;

typedef struct stc_ds_dsramr_field
{
    union {
        struct {
            __IO   uint8_t  SRAMR                :2;
            __IO   uint8_t  RESERVED0            :6;
        };
        struct {
            __IO   uint8_t  SRAMR0               :1;
            __IO   uint8_t  SRAMR1               :1;
            __IO   uint8_t  RESERVED1            :6;
        };
    };
} stc_ds_dsramr_field_t;

typedef struct stc_ds_wiolc_ctl_field
{
        __IO  uint32_t  LH_CL                    :1;
        __IO  uint32_t  RESERVED0                :7;
        __IO  uint32_t  CONTX                    :1;
        __IO  uint32_t  RESERVED1                :7;
        __IO  uint32_t  LHX_ST                   :1;
        __IO  uint32_t  RESERVED2                :15;
} stc_ds_wiolc_ctl_field_t;

typedef struct stc_ds_subosc_ctl_field
{
    union {
        struct {
            __IO   uint8_t  SUBXC                :2;
            __IO   uint8_t  RESERVED0            :6;
        };
        struct {
            __IO   uint8_t  SUBXC0               :1;
            __IO   uint8_t  SUBXC1               :1;
            __IO   uint8_t  RESERVED1            :6;
        };
    };
} stc_ds_subosc_ctl_field_t;

typedef struct stc_ds_cec_ctl_field
{
    union {
        struct {
            __IO   uint8_t  WS_CECR0B            :2;
            __IO   uint8_t  WS_CECR1B            :2;
            __IO   uint8_t  RESERVED0            :4;
        };
        struct {
            __IO   uint8_t  WS_CECR0B0           :1;
            __IO   uint8_t  WS_CECR0B1           :1;
            __IO   uint8_t  WS_CECR1B0           :1;
            __IO   uint8_t  WS_CECR1B1           :1;
            __IO   uint8_t  RESERVED1            :4;
        };
    };
} stc_ds_cec_ctl_field_t;

typedef struct stc_ds_debug_sw_ctl_field
{
        __IO   uint8_t  DBG_EN                   :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_ds_debug_sw_ctl_field_t;

