MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C11B0AGN20000/mcu.h
typedef struct stc_mtb_dwt_pid0_field
{
    union {
        struct {
            __IO  uint32_t  PERID                :32;
        };
        struct {
            __IO  uint32_t  PERID0               :1;
            __IO  uint32_t  PERID1               :1;
            __IO  uint32_t  PERID2               :1;
            __IO  uint32_t  PERID3               :1;
            __IO  uint32_t  PERID4               :1;
            __IO  uint32_t  PERID5               :1;
            __IO  uint32_t  PERID6               :1;
            __IO  uint32_t  PERID7               :1;
            __IO  uint32_t  PERID8               :1;
            __IO  uint32_t  PERID9               :1;
            __IO  uint32_t  PERID10              :1;
            __IO  uint32_t  PERID11              :1;
            __IO  uint32_t  PERID12              :1;
            __IO  uint32_t  PERID13              :1;
            __IO  uint32_t  PERID14              :1;
            __IO  uint32_t  PERID15              :1;
            __IO  uint32_t  PERID16              :1;
            __IO  uint32_t  PERID17              :1;
            __IO  uint32_t  PERID18              :1;
            __IO  uint32_t  PERID19              :1;
            __IO  uint32_t  PERID20              :1;
            __IO  uint32_t  PERID21              :1;
            __IO  uint32_t  PERID22              :1;
            __IO  uint32_t  PERID23              :1;
            __IO  uint32_t  PERID24              :1;
            __IO  uint32_t  PERID25              :1;
            __IO  uint32_t  PERID26              :1;
            __IO  uint32_t  PERID27              :1;
            __IO  uint32_t  PERID28              :1;
            __IO  uint32_t  PERID29              :1;
            __IO  uint32_t  PERID30              :1;
            __IO  uint32_t  PERID31              :1;
        };
    };
} stc_mtb_dwt_pid0_field_t;

typedef struct stc_mtb_dwt_pid1_field
{
    union {
        struct {
            __IO  uint32_t  PERID                :32;
        };
        struct {
            __IO  uint32_t  PERID0               :1;
            __IO  uint32_t  PERID1               :1;
            __IO  uint32_t  PERID2               :1;
            __IO  uint32_t  PERID3               :1;
            __IO  uint32_t  PERID4               :1;
            __IO  uint32_t  PERID5               :1;
            __IO  uint32_t  PERID6               :1;
            __IO  uint32_t  PERID7               :1;
            __IO  uint32_t  PERID8               :1;
            __IO  uint32_t  PERID9               :1;
            __IO  uint32_t  PERID10              :1;
            __IO  uint32_t  PERID11              :1;
            __IO  uint32_t  PERID12              :1;
            __IO  uint32_t  PERID13              :1;
            __IO  uint32_t  PERID14              :1;
            __IO  uint32_t  PERID15              :1;
            __IO  uint32_t  PERID16              :1;
            __IO  uint32_t  PERID17              :1;
            __IO  uint32_t  PERID18              :1;
            __IO  uint32_t  PERID19              :1;
            __IO  uint32_t  PERID20              :1;
            __IO  uint32_t  PERID21              :1;
            __IO  uint32_t  PERID22              :1;
            __IO  uint32_t  PERID23              :1;
            __IO  uint32_t  PERID24              :1;
            __IO  uint32_t  PERID25              :1;
            __IO  uint32_t  PERID26              :1;
            __IO  uint32_t  PERID27              :1;
            __IO  uint32_t  PERID28              :1;
            __IO  uint32_t  PERID29              :1;
            __IO  uint32_t  PERID30              :1;
            __IO  uint32_t  PERID31              :1;
        };
    };
} stc_mtb_dwt_pid1_field_t;

typedef struct stc_mtb_dwt_pid2_field
{
    union {
        struct {
            __IO  uint32_t  PERID                :32;
        };
        struct {
            __IO  uint32_t  PERID0               :1;
            __IO  uint32_t  PERID1               :1;
            __IO  uint32_t  PERID2               :1;
            __IO  uint32_t  PERID3               :1;
            __IO  uint32_t  PERID4               :1;
            __IO  uint32_t  PERID5               :1;
            __IO  uint32_t  PERID6               :1;
            __IO  uint32_t  PERID7               :1;
            __IO  uint32_t  PERID8               :1;
            __IO  uint32_t  PERID9               :1;
            __IO  uint32_t  PERID10              :1;
            __IO  uint32_t  PERID11              :1;
            __IO  uint32_t  PERID12              :1;
            __IO  uint32_t  PERID13              :1;
            __IO  uint32_t  PERID14              :1;
            __IO  uint32_t  PERID15              :1;
            __IO  uint32_t  PERID16              :1;
            __IO  uint32_t  PERID17              :1;
            __IO  uint32_t  PERID18              :1;
            __IO  uint32_t  PERID19              :1;
            __IO  uint32_t  PERID20              :1;
            __IO  uint32_t  PERID21              :1;
            __IO  uint32_t  PERID22              :1;
            __IO  uint32_t  PERID23              :1;
            __IO  uint32_t  PERID24              :1;
            __IO  uint32_t  PERID25              :1;
            __IO  uint32_t  PERID26              :1;
            __IO  uint32_t  PERID27              :1;
            __IO  uint32_t  PERID28              :1;
            __IO  uint32_t  PERID29              :1;
            __IO  uint32_t  PERID30              :1;
            __IO  uint32_t  PERID31              :1;
        };
    };
} stc_mtb_dwt_pid2_field_t;

typedef struct stc_mtb_dwt_pid3_field
{
    union {
        struct {
            __IO  uint32_t  PERID                :32;
        };
        struct {
            __IO  uint32_t  PERID0               :1;
            __IO  uint32_t  PERID1               :1;
            __IO  uint32_t  PERID2               :1;
            __IO  uint32_t  PERID3               :1;
            __IO  uint32_t  PERID4               :1;
            __IO  uint32_t  PERID5               :1;
            __IO  uint32_t  PERID6               :1;
            __IO  uint32_t  PERID7               :1;
            __IO  uint32_t  PERID8               :1;
            __IO  uint32_t  PERID9               :1;
            __IO  uint32_t  PERID10              :1;
            __IO  uint32_t  PERID11              :1;
            __IO  uint32_t  PERID12              :1;
            __IO  uint32_t  PERID13              :1;
            __IO  uint32_t  PERID14              :1;
            __IO  uint32_t  PERID15              :1;
            __IO  uint32_t  PERID16              :1;
            __IO  uint32_t  PERID17              :1;
            __IO  uint32_t  PERID18              :1;
            __IO  uint32_t  PERID19              :1;
            __IO  uint32_t  PERID20              :1;
            __IO  uint32_t  PERID21              :1;
            __IO  uint32_t  PERID22              :1;
            __IO  uint32_t  PERID23              :1;
            __IO  uint32_t  PERID24              :1;
            __IO  uint32_t  PERID25              :1;
            __IO  uint32_t  PERID26              :1;
            __IO  uint32_t  PERID27              :1;
            __IO  uint32_t  PERID28              :1;
            __IO  uint32_t  PERID29              :1;
            __IO  uint32_t  PERID30              :1;
            __IO  uint32_t  PERID31              :1;
        };
    };
} stc_mtb_dwt_pid3_field_t;

typedef struct stc_mtb_dwt_cid0_field
{
    union {
        struct {
            __IO  uint32_t  CPNTID               :32;
        };
        struct {
            __IO  uint32_t  CPNTID0              :1;
            __IO  uint32_t  CPNTID1              :1;
            __IO  uint32_t  CPNTID2              :1;
            __IO  uint32_t  CPNTID3              :1;
            __IO  uint32_t  CPNTID4              :1;
            __IO  uint32_t  CPNTID5              :1;
            __IO  uint32_t  CPNTID6              :1;
            __IO  uint32_t  CPNTID7              :1;
            __IO  uint32_t  CPNTID8              :1;
            __IO  uint32_t  CPNTID9              :1;
            __IO  uint32_t  CPNTID10             :1;
            __IO  uint32_t  CPNTID11             :1;
            __IO  uint32_t  CPNTID12             :1;
            __IO  uint32_t  CPNTID13             :1;
            __IO  uint32_t  CPNTID14             :1;
            __IO  uint32_t  CPNTID15             :1;
            __IO  uint32_t  CPNTID16             :1;
            __IO  uint32_t  CPNTID17             :1;
            __IO  uint32_t  CPNTID18             :1;
            __IO  uint32_t  CPNTID19             :1;
            __IO  uint32_t  CPNTID20             :1;
            __IO  uint32_t  CPNTID21             :1;
            __IO  uint32_t  CPNTID22             :1;
            __IO  uint32_t  CPNTID23             :1;
            __IO  uint32_t  CPNTID24             :1;
            __IO  uint32_t  CPNTID25             :1;
            __IO  uint32_t  CPNTID26             :1;
            __IO  uint32_t  CPNTID27             :1;
            __IO  uint32_t  CPNTID28             :1;
            __IO  uint32_t  CPNTID29             :1;
            __IO  uint32_t  CPNTID30             :1;
            __IO  uint32_t  CPNTID31             :1;
        };
    };
} stc_mtb_dwt_cid0_field_t;

typedef struct stc_mtb_dwt_cid1_field
{
    union {
        struct {
            __IO  uint32_t  CPNTID               :32;
        };
        struct {
            __IO  uint32_t  CPNTID0              :1;
            __IO  uint32_t  CPNTID1              :1;
            __IO  uint32_t  CPNTID2              :1;
            __IO  uint32_t  CPNTID3              :1;
            __IO  uint32_t  CPNTID4              :1;
            __IO  uint32_t  CPNTID5              :1;
            __IO  uint32_t  CPNTID6              :1;
            __IO  uint32_t  CPNTID7              :1;
            __IO  uint32_t  CPNTID8              :1;
            __IO  uint32_t  CPNTID9              :1;
            __IO  uint32_t  CPNTID10             :1;
            __IO  uint32_t  CPNTID11             :1;
            __IO  uint32_t  CPNTID12             :1;
            __IO  uint32_t  CPNTID13             :1;
            __IO  uint32_t  CPNTID14             :1;
            __IO  uint32_t  CPNTID15             :1;
            __IO  uint32_t  CPNTID16             :1;
            __IO  uint32_t  CPNTID17             :1;
            __IO  uint32_t  CPNTID18             :1;
            __IO  uint32_t  CPNTID19             :1;
            __IO  uint32_t  CPNTID20             :1;
            __IO  uint32_t  CPNTID21             :1;
            __IO  uint32_t  CPNTID22             :1;
            __IO  uint32_t  CPNTID23             :1;
            __IO  uint32_t  CPNTID24             :1;
            __IO  uint32_t  CPNTID25             :1;
            __IO  uint32_t  CPNTID26             :1;
            __IO  uint32_t  CPNTID27             :1;
            __IO  uint32_t  CPNTID28             :1;
            __IO  uint32_t  CPNTID29             :1;
            __IO  uint32_t  CPNTID30             :1;
            __IO  uint32_t  CPNTID31             :1;
        };
    };
} stc_mtb_dwt_cid1_field_t;

typedef struct stc_mtb_dwt_cid2_field
{
    union {
        struct {
            __IO  uint32_t  CPNTID               :32;
        };
        struct {
            __IO  uint32_t  CPNTID0              :1;
            __IO  uint32_t  CPNTID1              :1;
            __IO  uint32_t  CPNTID2              :1;
            __IO  uint32_t  CPNTID3              :1;
            __IO  uint32_t  CPNTID4              :1;
            __IO  uint32_t  CPNTID5              :1;
            __IO  uint32_t  CPNTID6              :1;
            __IO  uint32_t  CPNTID7              :1;
            __IO  uint32_t  CPNTID8              :1;
            __IO  uint32_t  CPNTID9              :1;
            __IO  uint32_t  CPNTID10             :1;
            __IO  uint32_t  CPNTID11             :1;
            __IO  uint32_t  CPNTID12             :1;
            __IO  uint32_t  CPNTID13             :1;
            __IO  uint32_t  CPNTID14             :1;
            __IO  uint32_t  CPNTID15             :1;
            __IO  uint32_t  CPNTID16             :1;
            __IO  uint32_t  CPNTID17             :1;
            __IO  uint32_t  CPNTID18             :1;
            __IO  uint32_t  CPNTID19             :1;
            __IO  uint32_t  CPNTID20             :1;
            __IO  uint32_t  CPNTID21             :1;
            __IO  uint32_t  CPNTID22             :1;
            __IO  uint32_t  CPNTID23             :1;
            __IO  uint32_t  CPNTID24             :1;
            __IO  uint32_t  CPNTID25             :1;
            __IO  uint32_t  CPNTID26             :1;
            __IO  uint32_t  CPNTID27             :1;
            __IO  uint32_t  CPNTID28             :1;
            __IO  uint32_t  CPNTID29             :1;
            __IO  uint32_t  CPNTID30             :1;
            __IO  uint32_t  CPNTID31             :1;
        };
    };
} stc_mtb_dwt_cid2_field_t;

typedef struct stc_mtb_dwt_cid3_field
{
    union {
        struct {
            __IO  uint32_t  CPNTID               :32;
        };
        struct {
            __IO  uint32_t  CPNTID0              :1;
            __IO  uint32_t  CPNTID1              :1;
            __IO  uint32_t  CPNTID2              :1;
            __IO  uint32_t  CPNTID3              :1;
            __IO  uint32_t  CPNTID4              :1;
            __IO  uint32_t  CPNTID5              :1;
            __IO  uint32_t  CPNTID6              :1;
            __IO  uint32_t  CPNTID7              :1;
            __IO  uint32_t  CPNTID8              :1;
            __IO  uint32_t  CPNTID9              :1;
            __IO  uint32_t  CPNTID10             :1;
            __IO  uint32_t  CPNTID11             :1;
            __IO  uint32_t  CPNTID12             :1;
            __IO  uint32_t  CPNTID13             :1;
            __IO  uint32_t  CPNTID14             :1;
            __IO  uint32_t  CPNTID15             :1;
            __IO  uint32_t  CPNTID16             :1;
            __IO  uint32_t  CPNTID17             :1;
            __IO  uint32_t  CPNTID18             :1;
            __IO  uint32_t  CPNTID19             :1;
            __IO  uint32_t  CPNTID20             :1;
            __IO  uint32_t  CPNTID21             :1;
            __IO  uint32_t  CPNTID22             :1;
            __IO  uint32_t  CPNTID23             :1;
            __IO  uint32_t  CPNTID24             :1;
            __IO  uint32_t  CPNTID25             :1;
            __IO  uint32_t  CPNTID26             :1;
            __IO  uint32_t  CPNTID27             :1;
            __IO  uint32_t  CPNTID28             :1;
            __IO  uint32_t  CPNTID29             :1;
            __IO  uint32_t  CPNTID30             :1;
            __IO  uint32_t  CPNTID31             :1;
        };
    };
} stc_mtb_dwt_cid3_field_t;

