MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C11B0AGN20000/mcu.h
#define bFM_EXTI_ELVR1_LA16                       *((volatile  uint8_t *)(0x42600200UL))
#define bFM0P_EXTI_ELVR1_LA16                     *((volatile  uint8_t *)(0x42600200UL))
#define bFM_EXTI_ELVR1_LB16                       *((volatile  uint8_t *)(0x42600204UL))
#define bFM0P_EXTI_ELVR1_LB16                     *((volatile  uint8_t *)(0x42600204UL))
#define bFM_EXTI_ELVR1_LA17                       *((volatile  uint8_t *)(0x42600208UL))
#define bFM0P_EXTI_ELVR1_LA17                     *((volatile  uint8_t *)(0x42600208UL))
#define bFM_EXTI_ELVR1_LB17                       *((volatile  uint8_t *)(0x4260020CUL))
#define bFM0P_EXTI_ELVR1_LB17                     *((volatile  uint8_t *)(0x4260020CUL))
#define bFM_EXTI_ELVR1_LA18                       *((volatile  uint8_t *)(0x42600210UL))
#define bFM0P_EXTI_ELVR1_LA18                     *((volatile  uint8_t *)(0x42600210UL))
#define bFM_EXTI_ELVR1_LB18                       *((volatile  uint8_t *)(0x42600214UL))
#define bFM0P_EXTI_ELVR1_LB18                     *((volatile  uint8_t *)(0x42600214UL))
#define bFM_EXTI_ELVR1_LA19                       *((volatile  uint8_t *)(0x42600218UL))
#define bFM0P_EXTI_ELVR1_LA19                     *((volatile  uint8_t *)(0x42600218UL))
#define bFM_EXTI_ELVR1_LB19                       *((volatile  uint8_t *)(0x4260021CUL))
#define bFM0P_EXTI_ELVR1_LB19                     *((volatile  uint8_t *)(0x4260021CUL))
#define bFM_EXTI_ELVR1_LA20                       *((volatile  uint8_t *)(0x42600220UL))
#define bFM0P_EXTI_ELVR1_LA20                     *((volatile  uint8_t *)(0x42600220UL))
#define bFM_EXTI_ELVR1_LB20                       *((volatile  uint8_t *)(0x42600224UL))
#define bFM0P_EXTI_ELVR1_LB20                     *((volatile  uint8_t *)(0x42600224UL))
#define bFM_EXTI_ELVR1_LA21                       *((volatile  uint8_t *)(0x42600228UL))
#define bFM0P_EXTI_ELVR1_LA21                     *((volatile  uint8_t *)(0x42600228UL))
#define bFM_EXTI_ELVR1_LB21                       *((volatile  uint8_t *)(0x4260022CUL))
#define bFM0P_EXTI_ELVR1_LB21                     *((volatile  uint8_t *)(0x4260022CUL))
#define bFM_EXTI_ELVR1_LA22                       *((volatile  uint8_t *)(0x42600230UL))
#define bFM0P_EXTI_ELVR1_LA22                     *((volatile  uint8_t *)(0x42600230UL))
#define bFM_EXTI_ELVR1_LB22                       *((volatile  uint8_t *)(0x42600234UL))
#define bFM0P_EXTI_ELVR1_LB22                     *((volatile  uint8_t *)(0x42600234UL))
#define bFM_EXTI_ELVR1_LA23                       *((volatile  uint8_t *)(0x42600238UL))
#define bFM0P_EXTI_ELVR1_LA23                     *((volatile  uint8_t *)(0x42600238UL))
#define bFM_EXTI_ELVR1_LB23                       *((volatile  uint8_t *)(0x4260023CUL))
#define bFM0P_EXTI_ELVR1_LB23                     *((volatile  uint8_t *)(0x4260023CUL))
#define bFM_EXTI_ELVR1_LA24                       *((volatile  uint8_t *)(0x42600240UL))
#define bFM0P_EXTI_ELVR1_LA24                     *((volatile  uint8_t *)(0x42600240UL))
#define bFM_EXTI_ELVR1_LB24                       *((volatile  uint8_t *)(0x42600244UL))
#define bFM0P_EXTI_ELVR1_LB24                     *((volatile  uint8_t *)(0x42600244UL))
#define bFM_EXTI_ELVR1_LA25                       *((volatile  uint8_t *)(0x42600248UL))
#define bFM0P_EXTI_ELVR1_LA25                     *((volatile  uint8_t *)(0x42600248UL))
#define bFM_EXTI_ELVR1_LB25                       *((volatile  uint8_t *)(0x4260024CUL))
#define bFM0P_EXTI_ELVR1_LB25                     *((volatile  uint8_t *)(0x4260024CUL))
#define bFM_EXTI_ELVR1_LA26                       *((volatile  uint8_t *)(0x42600250UL))
#define bFM0P_EXTI_ELVR1_LA26                     *((volatile  uint8_t *)(0x42600250UL))
#define bFM_EXTI_ELVR1_LB26                       *((volatile  uint8_t *)(0x42600254UL))
#define bFM0P_EXTI_ELVR1_LB26                     *((volatile  uint8_t *)(0x42600254UL))
#define bFM_EXTI_ELVR1_LA27                       *((volatile  uint8_t *)(0x42600258UL))
#define bFM0P_EXTI_ELVR1_LA27                     *((volatile  uint8_t *)(0x42600258UL))
#define bFM_EXTI_ELVR1_LB27                       *((volatile  uint8_t *)(0x4260025CUL))
#define bFM0P_EXTI_ELVR1_LB27                     *((volatile  uint8_t *)(0x4260025CUL))
#define bFM_EXTI_ELVR1_LA28                       *((volatile  uint8_t *)(0x42600260UL))
#define bFM0P_EXTI_ELVR1_LA28                     *((volatile  uint8_t *)(0x42600260UL))
#define bFM_EXTI_ELVR1_LB28                       *((volatile  uint8_t *)(0x42600264UL))
#define bFM0P_EXTI_ELVR1_LB28                     *((volatile  uint8_t *)(0x42600264UL))
#define bFM_EXTI_ELVR1_LA29                       *((volatile  uint8_t *)(0x42600268UL))
#define bFM0P_EXTI_ELVR1_LA29                     *((volatile  uint8_t *)(0x42600268UL))
#define bFM_EXTI_ELVR1_LB29                       *((volatile  uint8_t *)(0x4260026CUL))
#define bFM0P_EXTI_ELVR1_LB29                     *((volatile  uint8_t *)(0x4260026CUL))
#define bFM_EXTI_ELVR1_LA30                       *((volatile  uint8_t *)(0x42600270UL))
#define bFM0P_EXTI_ELVR1_LA30                     *((volatile  uint8_t *)(0x42600270UL))
#define bFM_EXTI_ELVR1_LB30                       *((volatile  uint8_t *)(0x42600274UL))
#define bFM0P_EXTI_ELVR1_LB30                     *((volatile  uint8_t *)(0x42600274UL))
#define bFM_EXTI_ELVR1_LA31                       *((volatile  uint8_t *)(0x42600278UL))
#define bFM0P_EXTI_ELVR1_LA31                     *((volatile  uint8_t *)(0x42600278UL))
#define bFM_EXTI_ELVR1_LB31                       *((volatile  uint8_t *)(0x4260027CUL))
#define bFM0P_EXTI_ELVR1_LB31                     *((volatile  uint8_t *)(0x4260027CUL))

#define bFM_EXTI_ELVR2_LC0                        *((volatile  uint8_t *)(0x42600380UL))
#define bFM0P_EXTI_ELVR2_LC0                      *((volatile  uint8_t *)(0x42600380UL))
#define bFM_EXTI_ELVR2_LC1                        *((volatile  uint8_t *)(0x42600384UL))
#define bFM0P_EXTI_ELVR2_LC1                      *((volatile  uint8_t *)(0x42600384UL))
#define bFM_EXTI_ELVR2_LC2                        *((volatile  uint8_t *)(0x42600388UL))
#define bFM0P_EXTI_ELVR2_LC2                      *((volatile  uint8_t *)(0x42600388UL))
#define bFM_EXTI_ELVR2_LC3                        *((volatile  uint8_t *)(0x4260038CUL))
#define bFM0P_EXTI_ELVR2_LC3                      *((volatile  uint8_t *)(0x4260038CUL))
#define bFM_EXTI_ELVR2_LC4                        *((volatile  uint8_t *)(0x42600390UL))
#define bFM0P_EXTI_ELVR2_LC4                      *((volatile  uint8_t *)(0x42600390UL))
#define bFM_EXTI_ELVR2_LC5                        *((volatile  uint8_t *)(0x42600394UL))
#define bFM0P_EXTI_ELVR2_LC5                      *((volatile  uint8_t *)(0x42600394UL))
#define bFM_EXTI_ELVR2_LC6                        *((volatile  uint8_t *)(0x42600398UL))
#define bFM0P_EXTI_ELVR2_LC6                      *((volatile  uint8_t *)(0x42600398UL))
#define bFM_EXTI_ELVR2_LC7                        *((volatile  uint8_t *)(0x4260039CUL))
#define bFM0P_EXTI_ELVR2_LC7                      *((volatile  uint8_t *)(0x4260039CUL))
#define bFM_EXTI_ELVR2_LC8                        *((volatile  uint8_t *)(0x426003A0UL))
#define bFM0P_EXTI_ELVR2_LC8                      *((volatile  uint8_t *)(0x426003A0UL))
#define bFM_EXTI_ELVR2_LC9                        *((volatile  uint8_t *)(0x426003A4UL))
#define bFM0P_EXTI_ELVR2_LC9                      *((volatile  uint8_t *)(0x426003A4UL))
#define bFM_EXTI_ELVR2_LC10                       *((volatile  uint8_t *)(0x426003A8UL))
#define bFM0P_EXTI_ELVR2_LC10                     *((volatile  uint8_t *)(0x426003A8UL))
#define bFM_EXTI_ELVR2_LC11                       *((volatile  uint8_t *)(0x426003ACUL))
#define bFM0P_EXTI_ELVR2_LC11                     *((volatile  uint8_t *)(0x426003ACUL))
#define bFM_EXTI_ELVR2_LC12                       *((volatile  uint8_t *)(0x426003B0UL))
#define bFM0P_EXTI_ELVR2_LC12                     *((volatile  uint8_t *)(0x426003B0UL))
#define bFM_EXTI_ELVR2_LC13                       *((volatile  uint8_t *)(0x426003B4UL))
#define bFM0P_EXTI_ELVR2_LC13                     *((volatile  uint8_t *)(0x426003B4UL))
#define bFM_EXTI_ELVR2_LC14                       *((volatile  uint8_t *)(0x426003B8UL))
#define bFM0P_EXTI_ELVR2_LC14                     *((volatile  uint8_t *)(0x426003B8UL))
#define bFM_EXTI_ELVR2_LC15                       *((volatile  uint8_t *)(0x426003BCUL))
#define bFM0P_EXTI_ELVR2_LC15                     *((volatile  uint8_t *)(0x426003BCUL))
#define bFM_EXTI_ELVR2_LC16                       *((volatile  uint8_t *)(0x426003C0UL))
#define bFM0P_EXTI_ELVR2_LC16                     *((volatile  uint8_t *)(0x426003C0UL))
#define bFM_EXTI_ELVR2_LC17                       *((volatile  uint8_t *)(0x426003C4UL))
#define bFM0P_EXTI_ELVR2_LC17                     *((volatile  uint8_t *)(0x426003C4UL))
#define bFM_EXTI_ELVR2_LC18                       *((volatile  uint8_t *)(0x426003C8UL))
#define bFM0P_EXTI_ELVR2_LC18                     *((volatile  uint8_t *)(0x426003C8UL))
#define bFM_EXTI_ELVR2_LC19                       *((volatile  uint8_t *)(0x426003CCUL))
#define bFM0P_EXTI_ELVR2_LC19                     *((volatile  uint8_t *)(0x426003CCUL))
#define bFM_EXTI_ELVR2_LC20                       *((volatile  uint8_t *)(0x426003D0UL))
#define bFM0P_EXTI_ELVR2_LC20                     *((volatile  uint8_t *)(0x426003D0UL))
#define bFM_EXTI_ELVR2_LC21                       *((volatile  uint8_t *)(0x426003D4UL))
#define bFM0P_EXTI_ELVR2_LC21                     *((volatile  uint8_t *)(0x426003D4UL))
#define bFM_EXTI_ELVR2_LC22                       *((volatile  uint8_t *)(0x426003D8UL))
#define bFM0P_EXTI_ELVR2_LC22                     *((volatile  uint8_t *)(0x426003D8UL))
#define bFM_EXTI_ELVR2_LC23                       *((volatile  uint8_t *)(0x426003DCUL))
#define bFM0P_EXTI_ELVR2_LC23                     *((volatile  uint8_t *)(0x426003DCUL))
#define bFM_EXTI_ELVR2_LC24                       *((volatile  uint8_t *)(0x426003E0UL))
#define bFM0P_EXTI_ELVR2_LC24                     *((volatile  uint8_t *)(0x426003E0UL))
#define bFM_EXTI_ELVR2_LC25                       *((volatile  uint8_t *)(0x426003E4UL))
#define bFM0P_EXTI_ELVR2_LC25                     *((volatile  uint8_t *)(0x426003E4UL))
#define bFM_EXTI_ELVR2_LC26                       *((volatile  uint8_t *)(0x426003E8UL))
#define bFM0P_EXTI_ELVR2_LC26                     *((volatile  uint8_t *)(0x426003E8UL))
#define bFM_EXTI_ELVR2_LC27                       *((volatile  uint8_t *)(0x426003ECUL))
#define bFM0P_EXTI_ELVR2_LC27                     *((volatile  uint8_t *)(0x426003ECUL))
#define bFM_EXTI_ELVR2_LC28                       *((volatile  uint8_t *)(0x426003F0UL))
#define bFM0P_EXTI_ELVR2_LC28                     *((volatile  uint8_t *)(0x426003F0UL))
#define bFM_EXTI_ELVR2_LC29                       *((volatile  uint8_t *)(0x426003F4UL))
#define bFM0P_EXTI_ELVR2_LC29                     *((volatile  uint8_t *)(0x426003F4UL))
#define bFM_EXTI_ELVR2_LC30                       *((volatile  uint8_t *)(0x426003F8UL))
#define bFM0P_EXTI_ELVR2_LC30                     *((volatile  uint8_t *)(0x426003F8UL))
#define bFM_EXTI_ELVR2_LC31                       *((volatile  uint8_t *)(0x426003FCUL))
#define bFM0P_EXTI_ELVR2_LC31                     *((volatile  uint8_t *)(0x426003FCUL))

#define bFM_EXTI_ENIR_EN0                         *((volatile  uint8_t *)(0x42600000UL))
#define bFM0P_EXTI_ENIR_EN0                       *((volatile  uint8_t *)(0x42600000UL))
#define bFM_EXTI_ENIR_EN1                         *((volatile  uint8_t *)(0x42600004UL))
#define bFM0P_EXTI_ENIR_EN1                       *((volatile  uint8_t *)(0x42600004UL))
#define bFM_EXTI_ENIR_EN2                         *((volatile  uint8_t *)(0x42600008UL))
#define bFM0P_EXTI_ENIR_EN2                       *((volatile  uint8_t *)(0x42600008UL))
#define bFM_EXTI_ENIR_EN3                         *((volatile  uint8_t *)(0x4260000CUL))
#define bFM0P_EXTI_ENIR_EN3                       *((volatile  uint8_t *)(0x4260000CUL))
#define bFM_EXTI_ENIR_EN4                         *((volatile  uint8_t *)(0x42600010UL))
#define bFM0P_EXTI_ENIR_EN4                       *((volatile  uint8_t *)(0x42600010UL))
#define bFM_EXTI_ENIR_EN5                         *((volatile  uint8_t *)(0x42600014UL))
#define bFM0P_EXTI_ENIR_EN5                       *((volatile  uint8_t *)(0x42600014UL))
#define bFM_EXTI_ENIR_EN6                         *((volatile  uint8_t *)(0x42600018UL))
#define bFM0P_EXTI_ENIR_EN6                       *((volatile  uint8_t *)(0x42600018UL))
#define bFM_EXTI_ENIR_EN7                         *((volatile  uint8_t *)(0x4260001CUL))
#define bFM0P_EXTI_ENIR_EN7                       *((volatile  uint8_t *)(0x4260001CUL))
#define bFM_EXTI_ENIR_EN8                         *((volatile  uint8_t *)(0x42600020UL))
#define bFM0P_EXTI_ENIR_EN8                       *((volatile  uint8_t *)(0x42600020UL))
#define bFM_EXTI_ENIR_EN9                         *((volatile  uint8_t *)(0x42600024UL))
#define bFM0P_EXTI_ENIR_EN9                       *((volatile  uint8_t *)(0x42600024UL))
#define bFM_EXTI_ENIR_EN10                        *((volatile  uint8_t *)(0x42600028UL))
#define bFM0P_EXTI_ENIR_EN10                      *((volatile  uint8_t *)(0x42600028UL))
#define bFM_EXTI_ENIR_EN11                        *((volatile  uint8_t *)(0x4260002CUL))
#define bFM0P_EXTI_ENIR_EN11                      *((volatile  uint8_t *)(0x4260002CUL))
#define bFM_EXTI_ENIR_EN12                        *((volatile  uint8_t *)(0x42600030UL))
#define bFM0P_EXTI_ENIR_EN12                      *((volatile  uint8_t *)(0x42600030UL))
#define bFM_EXTI_ENIR_EN13                        *((volatile  uint8_t *)(0x42600034UL))
#define bFM0P_EXTI_ENIR_EN13                      *((volatile  uint8_t *)(0x42600034UL))
#define bFM_EXTI_ENIR_EN14                        *((volatile  uint8_t *)(0x42600038UL))
#define bFM0P_EXTI_ENIR_EN14                      *((volatile  uint8_t *)(0x42600038UL))
#define bFM_EXTI_ENIR_EN15                        *((volatile  uint8_t *)(0x4260003CUL))
#define bFM0P_EXTI_ENIR_EN15                      *((volatile  uint8_t *)(0x4260003CUL))
#define bFM_EXTI_ENIR_EN16                        *((volatile  uint8_t *)(0x42600040UL))
#define bFM0P_EXTI_ENIR_EN16                      *((volatile  uint8_t *)(0x42600040UL))
#define bFM_EXTI_ENIR_EN17                        *((volatile  uint8_t *)(0x42600044UL))
#define bFM0P_EXTI_ENIR_EN17                      *((volatile  uint8_t *)(0x42600044UL))
#define bFM_EXTI_ENIR_EN18                        *((volatile  uint8_t *)(0x42600048UL))
#define bFM0P_EXTI_ENIR_EN18                      *((volatile  uint8_t *)(0x42600048UL))
#define bFM_EXTI_ENIR_EN19                        *((volatile  uint8_t *)(0x4260004CUL))
#define bFM0P_EXTI_ENIR_EN19                      *((volatile  uint8_t *)(0x4260004CUL))
#define bFM_EXTI_ENIR_EN20                        *((volatile  uint8_t *)(0x42600050UL))
#define bFM0P_EXTI_ENIR_EN20                      *((volatile  uint8_t *)(0x42600050UL))
#define bFM_EXTI_ENIR_EN21                        *((volatile  uint8_t *)(0x42600054UL))
#define bFM0P_EXTI_ENIR_EN21                      *((volatile  uint8_t *)(0x42600054UL))
#define bFM_EXTI_ENIR_EN22                        *((volatile  uint8_t *)(0x42600058UL))
#define bFM0P_EXTI_ENIR_EN22                      *((volatile  uint8_t *)(0x42600058UL))
#define bFM_EXTI_ENIR_EN23                        *((volatile  uint8_t *)(0x4260005CUL))
#define bFM0P_EXTI_ENIR_EN23                      *((volatile  uint8_t *)(0x4260005CUL))
#define bFM_EXTI_ENIR_EN24                        *((volatile  uint8_t *)(0x42600060UL))
#define bFM0P_EXTI_ENIR_EN24                      *((volatile  uint8_t *)(0x42600060UL))
#define bFM_EXTI_ENIR_EN25                        *((volatile  uint8_t *)(0x42600064UL))
#define bFM0P_EXTI_ENIR_EN25                      *((volatile  uint8_t *)(0x42600064UL))
#define bFM_EXTI_ENIR_EN26                        *((volatile  uint8_t *)(0x42600068UL))
#define bFM0P_EXTI_ENIR_EN26                      *((volatile  uint8_t *)(0x42600068UL))
#define bFM_EXTI_ENIR_EN27                        *((volatile  uint8_t *)(0x4260006CUL))
#define bFM0P_EXTI_ENIR_EN27                      *((volatile  uint8_t *)(0x4260006CUL))
#define bFM_EXTI_ENIR_EN28                        *((volatile  uint8_t *)(0x42600070UL))
#define bFM0P_EXTI_ENIR_EN28                      *((volatile  uint8_t *)(0x42600070UL))
#define bFM_EXTI_ENIR_EN29                        *((volatile  uint8_t *)(0x42600074UL))
#define bFM0P_EXTI_ENIR_EN29                      *((volatile  uint8_t *)(0x42600074UL))
#define bFM_EXTI_ENIR_EN30                        *((volatile  uint8_t *)(0x42600078UL))
#define bFM0P_EXTI_ENIR_EN30                      *((volatile  uint8_t *)(0x42600078UL))
#define bFM_EXTI_ENIR_EN31                        *((volatile  uint8_t *)(0x4260007CUL))
#define bFM0P_EXTI_ENIR_EN31                      *((volatile  uint8_t *)(0x4260007CUL))

