MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C11B0AGN20000/mcu.h
#define bFM_HDMICEC1_RCST_OVF                     *((volatile  uint8_t *)(0x42682800UL))
#define bFM0P_HDMICEC1_RCST_OVF                   *((volatile  uint8_t *)(0x42682800UL))
#define bFM_HDMICEC1_RCST_EOM                     *((volatile  uint8_t *)(0x42682804UL))
#define bFM0P_HDMICEC1_RCST_EOM                   *((volatile  uint8_t *)(0x42682804UL))
#define bFM_HDMICEC1_RCST_ACK                     *((volatile  uint8_t *)(0x42682808UL))
#define bFM0P_HDMICEC1_RCST_ACK                   *((volatile  uint8_t *)(0x42682808UL))
#define bFM_HDMICEC1_RCST_ST                      *((volatile  uint8_t *)(0x4268280CUL))
#define bFM0P_HDMICEC1_RCST_ST                    *((volatile  uint8_t *)(0x4268280CUL))
#define bFM_HDMICEC1_RCST_OVFSEL                  *((volatile  uint8_t *)(0x42682810UL))
#define bFM0P_HDMICEC1_RCST_OVFSEL                *((volatile  uint8_t *)(0x42682810UL))
#define bFM_HDMICEC1_RCST_OVFIE                   *((volatile  uint8_t *)(0x42682814UL))
#define bFM0P_HDMICEC1_RCST_OVFIE                 *((volatile  uint8_t *)(0x42682814UL))
#define bFM_HDMICEC1_RCST_ACKIE                   *((volatile  uint8_t *)(0x42682818UL))
#define bFM0P_HDMICEC1_RCST_ACKIE                 *((volatile  uint8_t *)(0x42682818UL))
#define bFM_HDMICEC1_RCST_STIE                    *((volatile  uint8_t *)(0x4268281CUL))
#define bFM0P_HDMICEC1_RCST_STIE                  *((volatile  uint8_t *)(0x4268281CUL))

#define bFM_HDMICEC1_TXCTRL_TXEN                  *((volatile  uint8_t *)(0x42682000UL))
#define bFM0P_HDMICEC1_TXCTRL_TXEN                *((volatile  uint8_t *)(0x42682000UL))
#define bFM_HDMICEC1_TXCTRL_START                 *((volatile  uint8_t *)(0x42682008UL))
#define bFM0P_HDMICEC1_TXCTRL_START               *((volatile  uint8_t *)(0x42682008UL))
#define bFM_HDMICEC1_TXCTRL_EOM                   *((volatile  uint8_t *)(0x4268200CUL))
#define bFM0P_HDMICEC1_TXCTRL_EOM                 *((volatile  uint8_t *)(0x4268200CUL))
#define bFM_HDMICEC1_TXCTRL_ITSTEN                *((volatile  uint8_t *)(0x42682010UL))
#define bFM0P_HDMICEC1_TXCTRL_ITSTEN              *((volatile  uint8_t *)(0x42682010UL))
#define bFM_HDMICEC1_TXCTRL_IBREN                 *((volatile  uint8_t *)(0x42682014UL))
#define bFM0P_HDMICEC1_TXCTRL_IBREN               *((volatile  uint8_t *)(0x42682014UL))

#define bFM_HDMICEC1_TXSTS_ACKSV                  *((volatile  uint8_t *)(0x42682100UL))
#define bFM0P_HDMICEC1_TXSTS_ACKSV                *((volatile  uint8_t *)(0x42682100UL))
#define bFM_HDMICEC1_TXSTS_ITST                   *((volatile  uint8_t *)(0x42682110UL))
#define bFM0P_HDMICEC1_TXSTS_ITST                 *((volatile  uint8_t *)(0x42682110UL))
#define bFM_HDMICEC1_TXSTS_IBR                    *((volatile  uint8_t *)(0x42682114UL))
#define bFM0P_HDMICEC1_TXSTS_IBR                  *((volatile  uint8_t *)(0x42682114UL))


/*******************************************************************************
* HWWDT Registers HWWDT
*   Bitband Section
*******************************************************************************/
#define bFM_HWWDT_WDG_CTL_INTEN                   *((volatile  uint32_t*)(0x42220100UL))
#define bFM0P_HWWDT_WDG_CTL_INTEN                 *((volatile  uint32_t*)(0x42220100UL))
#define bFM_HWWDT_WDG_CTL_RESEN                   *((volatile  uint32_t*)(0x42220104UL))
#define bFM0P_HWWDT_WDG_CTL_RESEN                 *((volatile  uint32_t*)(0x42220104UL))

#define bFM_HWWDT_WDG_RIS_RIS                     *((volatile  uint32_t*)(0x42220200UL))
#define bFM0P_HWWDT_WDG_RIS_RIS                   *((volatile  uint32_t*)(0x42220200UL))


/*******************************************************************************
* I2CSLAVE Registers I2CSLAVE
*   Bitband Section
*******************************************************************************/
#define bFM_I2CSLAVE_IBSADR_SAEN                  *((volatile  uint8_t *)(0x426F309CUL))
#define bFM0P_I2CSLAVE_IBSADR_SAEN                *((volatile  uint8_t *)(0x426F309CUL))

#define bFM_I2CSLAVE_IBSCR_TIE                    *((volatile  uint8_t *)(0x426F3040UL))
#define bFM0P_I2CSLAVE_IBSCR_TIE                  *((volatile  uint8_t *)(0x426F3040UL))
#define bFM_I2CSLAVE_IBSCR_RIE                    *((volatile  uint8_t *)(0x426F3044UL))
#define bFM0P_I2CSLAVE_IBSCR_RIE                  *((volatile  uint8_t *)(0x426F3044UL))
#define bFM_I2CSLAVE_IBSCR_INTE                   *((volatile  uint8_t *)(0x426F3048UL))
#define bFM0P_I2CSLAVE_IBSCR_INTE                 *((volatile  uint8_t *)(0x426F3048UL))
#define bFM_I2CSLAVE_IBSCR_CNDE                   *((volatile  uint8_t *)(0x426F304CUL))
#define bFM0P_I2CSLAVE_IBSCR_CNDE                 *((volatile  uint8_t *)(0x426F304CUL))
#define bFM_I2CSLAVE_IBSCR_WSEL                   *((volatile  uint8_t *)(0x426F3050UL))
#define bFM0P_I2CSLAVE_IBSCR_WSEL                 *((volatile  uint8_t *)(0x426F3050UL))
#define bFM_I2CSLAVE_IBSCR_ACKE                   *((volatile  uint8_t *)(0x426F3054UL))
#define bFM0P_I2CSLAVE_IBSCR_ACKE                 *((volatile  uint8_t *)(0x426F3054UL))
#define bFM_I2CSLAVE_IBSCR_RSVEN                  *((volatile  uint8_t *)(0x426F305CUL))
#define bFM0P_I2CSLAVE_IBSCR_RSVEN                *((volatile  uint8_t *)(0x426F305CUL))

#define bFM_I2CSLAVE_IBSMSKR_EN                   *((volatile  uint8_t *)(0x426F30BCUL))
#define bFM0P_I2CSLAVE_IBSMSKR_EN                 *((volatile  uint8_t *)(0x426F30BCUL))

#define bFM_I2CSLAVE_IBSSCR_SPCC                  *((volatile  uint8_t *)(0x426F3204UL))
#define bFM0P_I2CSLAVE_IBSSCR_SPCC                *((volatile  uint8_t *)(0x426F3204UL))
#define bFM_I2CSLAVE_IBSSCR_RSCC                  *((volatile  uint8_t *)(0x426F3208UL))
#define bFM0P_I2CSLAVE_IBSSCR_RSCC                *((volatile  uint8_t *)(0x426F3208UL))
#define bFM_I2CSLAVE_IBSSCR_INTC                  *((volatile  uint8_t *)(0x426F3228UL))
#define bFM0P_I2CSLAVE_IBSSCR_INTC                *((volatile  uint8_t *)(0x426F3228UL))

#define bFM_I2CSLAVE_IBSSR_BB                     *((volatile  uint8_t *)(0x426F3000UL))
#define bFM0P_I2CSLAVE_IBSSR_BB                   *((volatile  uint8_t *)(0x426F3000UL))
#define bFM_I2CSLAVE_IBSSR_SPC                    *((volatile  uint8_t *)(0x426F3004UL))
#define bFM0P_I2CSLAVE_IBSSR_SPC                  *((volatile  uint8_t *)(0x426F3004UL))
#define bFM_I2CSLAVE_IBSSR_RSC                    *((volatile  uint8_t *)(0x426F3008UL))
#define bFM0P_I2CSLAVE_IBSSR_RSC                  *((volatile  uint8_t *)(0x426F3008UL))
#define bFM_I2CSLAVE_IBSSR_ACT                    *((volatile  uint8_t *)(0x426F300CUL))
#define bFM0P_I2CSLAVE_IBSSR_ACT                  *((volatile  uint8_t *)(0x426F300CUL))
#define bFM_I2CSLAVE_IBSSR_TRX                    *((volatile  uint8_t *)(0x426F3010UL))
#define bFM0P_I2CSLAVE_IBSSR_TRX                  *((volatile  uint8_t *)(0x426F3010UL))
#define bFM_I2CSLAVE_IBSSR_RSA                    *((volatile  uint8_t *)(0x426F3014UL))
#define bFM0P_I2CSLAVE_IBSSR_RSA                  *((volatile  uint8_t *)(0x426F3014UL))
#define bFM_I2CSLAVE_IBSSR_RACK                   *((volatile  uint8_t *)(0x426F3018UL))
#define bFM0P_I2CSLAVE_IBSSR_RACK                 *((volatile  uint8_t *)(0x426F3018UL))
#define bFM_I2CSLAVE_IBSSR_FBT                    *((volatile  uint8_t *)(0x426F301CUL))
#define bFM0P_I2CSLAVE_IBSSR_FBT                  *((volatile  uint8_t *)(0x426F301CUL))
#define bFM_I2CSLAVE_IBSSR_TDRE                   *((volatile  uint8_t *)(0x426F3020UL))
#define bFM0P_I2CSLAVE_IBSSR_TDRE                 *((volatile  uint8_t *)(0x426F3020UL))
#define bFM_I2CSLAVE_IBSSR_RDRF                   *((volatile  uint8_t *)(0x426F3024UL))
#define bFM0P_I2CSLAVE_IBSSR_RDRF                 *((volatile  uint8_t *)(0x426F3024UL))
#define bFM_I2CSLAVE_IBSSR_INT                    *((volatile  uint8_t *)(0x426F3028UL))
#define bFM0P_I2CSLAVE_IBSSR_INT                  *((volatile  uint8_t *)(0x426F3028UL))

