MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C11B0AGN20000/mcu.h
#define bFM_MFS4_I2C_IBSR_BB                      *((volatile  uint8_t *)(0x42708080UL))
#define bFM0P_MFS4_I2C_IBSR_BB                    *((volatile  uint8_t *)(0x42708080UL))
#define bFM_MFS4_I2C_IBSR_SPC                     *((volatile  uint8_t *)(0x42708084UL))
#define bFM0P_MFS4_I2C_IBSR_SPC                   *((volatile  uint8_t *)(0x42708084UL))
#define bFM_MFS4_I2C_IBSR_RSC                     *((volatile  uint8_t *)(0x42708088UL))
#define bFM0P_MFS4_I2C_IBSR_RSC                   *((volatile  uint8_t *)(0x42708088UL))
#define bFM_MFS4_I2C_IBSR_AL                      *((volatile  uint8_t *)(0x4270808CUL))
#define bFM0P_MFS4_I2C_IBSR_AL                    *((volatile  uint8_t *)(0x4270808CUL))
#define bFM_MFS4_I2C_IBSR_TRX                     *((volatile  uint8_t *)(0x42708090UL))
#define bFM0P_MFS4_I2C_IBSR_TRX                   *((volatile  uint8_t *)(0x42708090UL))
#define bFM_MFS4_I2C_IBSR_RSA                     *((volatile  uint8_t *)(0x42708094UL))
#define bFM0P_MFS4_I2C_IBSR_RSA                   *((volatile  uint8_t *)(0x42708094UL))
#define bFM_MFS4_I2C_IBSR_RACK                    *((volatile  uint8_t *)(0x42708098UL))
#define bFM0P_MFS4_I2C_IBSR_RACK                  *((volatile  uint8_t *)(0x42708098UL))
#define bFM_MFS4_I2C_IBSR_FBT                     *((volatile  uint8_t *)(0x4270809CUL))
#define bFM0P_MFS4_I2C_IBSR_FBT                   *((volatile  uint8_t *)(0x4270809CUL))

#define bFM_MFS4_I2C_ISBA_SAEN                    *((volatile  uint8_t *)(0x4270821CUL))
#define bFM0P_MFS4_I2C_ISBA_SAEN                  *((volatile  uint8_t *)(0x4270821CUL))

#define bFM_MFS4_I2C_ISMK_EN                      *((volatile  uint8_t *)(0x4270823CUL))
#define bFM0P_MFS4_I2C_ISMK_EN                    *((volatile  uint8_t *)(0x4270823CUL))

#define bFM_MFS4_I2C_SMR_TIE                      *((volatile  uint8_t *)(0x42708008UL))
#define bFM0P_MFS4_I2C_SMR_TIE                    *((volatile  uint8_t *)(0x42708008UL))
#define bFM_MFS4_I2C_SMR_RIE                      *((volatile  uint8_t *)(0x4270800CUL))
#define bFM0P_MFS4_I2C_SMR_RIE                    *((volatile  uint8_t *)(0x4270800CUL))

#define bFM_MFS4_I2C_SSR_TBI                      *((volatile  uint8_t *)(0x427080A0UL))
#define bFM0P_MFS4_I2C_SSR_TBI                    *((volatile  uint8_t *)(0x427080A0UL))
#define bFM_MFS4_I2C_SSR_TDRE                     *((volatile  uint8_t *)(0x427080A4UL))
#define bFM0P_MFS4_I2C_SSR_TDRE                   *((volatile  uint8_t *)(0x427080A4UL))
#define bFM_MFS4_I2C_SSR_RDRF                     *((volatile  uint8_t *)(0x427080A8UL))
#define bFM0P_MFS4_I2C_SSR_RDRF                   *((volatile  uint8_t *)(0x427080A8UL))
#define bFM_MFS4_I2C_SSR_ORE                      *((volatile  uint8_t *)(0x427080ACUL))
#define bFM0P_MFS4_I2C_SSR_ORE                    *((volatile  uint8_t *)(0x427080ACUL))
#define bFM_MFS4_I2C_SSR_TBIE                     *((volatile  uint8_t *)(0x427080B0UL))
#define bFM0P_MFS4_I2C_SSR_TBIE                   *((volatile  uint8_t *)(0x427080B0UL))
#define bFM_MFS4_I2C_SSR_DMA                      *((volatile  uint8_t *)(0x427080B4UL))
#define bFM0P_MFS4_I2C_SSR_DMA                    *((volatile  uint8_t *)(0x427080B4UL))
#define bFM_MFS4_I2C_SSR_TSET                     *((volatile  uint8_t *)(0x427080B8UL))
#define bFM0P_MFS4_I2C_SSR_TSET                   *((volatile  uint8_t *)(0x427080B8UL))
#define bFM_MFS4_I2C_SSR_REC                      *((volatile  uint8_t *)(0x427080BCUL))
#define bFM0P_MFS4_I2C_SSR_REC                    *((volatile  uint8_t *)(0x427080BCUL))

#define bFM_MFS4_I2S_ESCR_L3                      *((volatile  uint8_t *)(0x42708098UL))
#define bFM0P_MFS4_I2S_ESCR_L3                    *((volatile  uint8_t *)(0x42708098UL))
#define bFM_MFS4_I2S_ESCR_SOP                     *((volatile  uint8_t *)(0x4270809CUL))
#define bFM0P_MFS4_I2S_ESCR_SOP                   *((volatile  uint8_t *)(0x4270809CUL))

#define bFM_MFS4_I2S_FCR_FE1                      *((volatile  uint8_t *)(0x42708280UL))
#define bFM0P_MFS4_I2S_FCR_FE1                    *((volatile  uint8_t *)(0x42708280UL))
#define bFM_MFS4_I2S_FCR_FE2                      *((volatile  uint8_t *)(0x42708284UL))
#define bFM0P_MFS4_I2S_FCR_FE2                    *((volatile  uint8_t *)(0x42708284UL))
#define bFM_MFS4_I2S_FCR_FCL1                     *((volatile  uint8_t *)(0x42708288UL))
#define bFM0P_MFS4_I2S_FCR_FCL1                   *((volatile  uint8_t *)(0x42708288UL))
#define bFM_MFS4_I2S_FCR_FCL2                     *((volatile  uint8_t *)(0x4270828CUL))
#define bFM0P_MFS4_I2S_FCR_FCL2                   *((volatile  uint8_t *)(0x4270828CUL))
#define bFM_MFS4_I2S_FCR_FSEL                     *((volatile  uint8_t *)(0x427082A0UL))
#define bFM0P_MFS4_I2S_FCR_FSEL                   *((volatile  uint8_t *)(0x427082A0UL))
#define bFM_MFS4_I2S_FCR_FTIE                     *((volatile  uint8_t *)(0x427082A4UL))
#define bFM0P_MFS4_I2S_FCR_FTIE                   *((volatile  uint8_t *)(0x427082A4UL))
#define bFM_MFS4_I2S_FCR_FDRQ                     *((volatile  uint8_t *)(0x427082A8UL))
#define bFM0P_MFS4_I2S_FCR_FDRQ                   *((volatile  uint8_t *)(0x427082A8UL))

#define bFM_MFS4_I2S_SCR_TXE                      *((volatile  uint8_t *)(0x42708020UL))
#define bFM0P_MFS4_I2S_SCR_TXE                    *((volatile  uint8_t *)(0x42708020UL))
#define bFM_MFS4_I2S_SCR_RXE                      *((volatile  uint8_t *)(0x42708024UL))
#define bFM0P_MFS4_I2S_SCR_RXE                    *((volatile  uint8_t *)(0x42708024UL))
#define bFM_MFS4_I2S_SCR_RIE                      *((volatile  uint8_t *)(0x42708030UL))
#define bFM0P_MFS4_I2S_SCR_RIE                    *((volatile  uint8_t *)(0x42708030UL))
#define bFM_MFS4_I2S_SCR_MS                       *((volatile  uint8_t *)(0x42708038UL))
#define bFM0P_MFS4_I2S_SCR_MS                     *((volatile  uint8_t *)(0x42708038UL))
#define bFM_MFS4_I2S_SCR_UPCL                     *((volatile  uint8_t *)(0x4270803CUL))
#define bFM0P_MFS4_I2S_SCR_UPCL                   *((volatile  uint8_t *)(0x4270803CUL))

#define bFM_MFS4_I2S_SMR_SOE                      *((volatile  uint8_t *)(0x42708000UL))
#define bFM0P_MFS4_I2S_SMR_SOE                    *((volatile  uint8_t *)(0x42708000UL))
#define bFM_MFS4_I2S_SMR_BDS                      *((volatile  uint8_t *)(0x42708008UL))
#define bFM0P_MFS4_I2S_SMR_BDS                    *((volatile  uint8_t *)(0x42708008UL))

